Welcome to SWI-Prolog (Multi-threaded, Version 5.4.7)
Copyright (c) 1990-2003 University of Amsterdam.
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software,
and you are welcome to redistribute it under certain conditions.
Please visit http://www.swi-prolog.org for details.

For help, use ?- help(Topic). or ?- apropos(Word).

?- [a4].
% a4 compiled 0.01 sec, 10,432 bytes

Yes
?- interpret([a,a,a,s,k,k,k],Y).

Y = [k]

Yes
?- interpret([a,a,d,a,dot(i),i,a,dot(h),i],R).
hi

R = [i]

Yes
?- interpretFromText("```skkk",R).

R = "k"

Yes
?- interpretFromText("`.G`.o`.o`.d`.b`.y`.e`. `.W`.o`.r`.l`.d`ri",R).

dlroW eybdooG

R = "i"

Yes
?- interpretFromText("`v`.G`.o`.o`.d`.b`.y`.e`. `.W`.o`.r`.l`.d`ri",R).

dlroW eybdooG

R = "v"

Yes
?- interpretFromText("```s``s``sii`ki`k.*``s``s`ks``s`k`s`ks``s
                      ``s`ks``s`k`s`kr``s`k`sikk`k``s`ksk",R).

*
*
**
***
*****
********
*************
*********************
**********************************
*******************************************************
*****************************************************************************************
************************************************************************************************************************************************
*****************************************************************************************************************************************************************************************************************************************
*****************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
**********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
***************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
*************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************

% Plus much more stuff here... this goes on forever

?- unlambdafy(var(x),R).

R = "x"

Yes
?- unlambdafy(func(r),R).

R = "r"

Yes
?- unlambdafy(func(dot(x)),R).

R = ".x"

Yes
?- unlambdafy(func(v),R).

R = "v"

Yes
?- unlambdafy(func(d),R).

R = "d"

Yes
?- unlambdafy(func(x),R).

No

?- unlambdafy(app(app(func(d),app(func(r),func(i))),func(v)),R).

R = "aadariv"

Yes
?- reduce(app(app(func(d),app(func(r),func(i))),func(v)),R).


R = [v]

Yes

?- reduce(app(func(d),app(func(r),func(i))),R).

R = [promise([a, r, i])]

Yes

